# IndexTriangle Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IndexTriangle Members
IndexTriangle Class Constructors Methods Properties See Also
---
The IndexTriangle type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IndexTriangle | Constructs the triangle primitive. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from IndexPrimitive.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetSizeInShortInts | Gets the amount of storage that the primitive takes up in a buffer, measured in short integers. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Index0 | The index of the triangle's first vertex. |
| Index1 | The index of the triangle's second vertex. |
| Index2 | The index of the triangle's third vertex. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from IndexPrimitive.) |

# See Also
IndexTriangle Class
Autodesk.Revit.DB.DirectContext3D Namespace